In [25]:
import pandas as pd

# Pandas series

In [2]:
ser=pd.Series([22,34,76],["Deepak","Amit","Rashmi"])
ser

Deepak    22
Amit      34
Rashmi    76
dtype: int64

In [3]:
ser.index

Index(['Deepak', 'Amit', 'Rashmi'], dtype='object')

In [5]:
ser.loc[['Deepak','Amit']]

Deepak    22
Amit      34
dtype: int64

## Series is 1D labelled array

In [6]:
ser.loc['Deepak']

22

In [13]:
ser[[2]]

Rashmi    76
dtype: int64

In [15]:
ser.iloc[0]

22

In [16]:
for i in (0:3):
    ser[[i]]

SyntaxError: invalid syntax (<ipython-input-16-0a7c695852a5>, line 1)

In [17]:
"Deepak" in ser

True

In [18]:
22 in ser

False

In [19]:
ser*2

Deepak     44
Amit       68
Rashmi    152
dtype: int64

In [20]:
ser**2

Deepak     484
Amit      1156
Rashmi    5776
dtype: int64

In [21]:
ser[['Amit','Deepak']]**2

Amit      1156
Deepak     484
dtype: int64

# pandas DataFrame
Creating DataFrame from dictionary of Python series

In [22]:
d={'Age':pd.Series([22,23,45],index=['D','A','C']),
   'Salary':pd.Series([1000,2000,3000],index=['D','A','C'])}

In [33]:
df=pd.DataFrame(d)
df

   Age  Salary
D   22    1000
A   23    2000
C   45    3000

In [30]:
df.index

Index(['D', 'A', 'C'], dtype='object')

In [31]:
df.columns

Index(['Age', 'Salary'], dtype='object')

In [32]:
pd.DataFrame(d,index=['D','A'])

   Age  Salary
D   22    1000
A   23    2000

In [34]:
pd.DataFrame(d,index=['D','A','C'],columns=['Age'])

   Age
D   22
A   23
C   45

In [36]:
data=[{'Deepak':1,'Ashish':2},{'Kavita':5,'Anmole':10,"Sanyam":20,"Deepak":20}]
pd.DataFrame(data)

   Anmole  Ashish  Deepak  Kavita  Sanyam
0     NaN     2.0       1     NaN     NaN
1    10.0     NaN      20     5.0    20.0

In [38]:
pd.DataFrame(data,index=["Section 1","Section 2"])

           Anmole  Ashish  Deepak  Kavita  Sanyam
Section 1     NaN     2.0       1     NaN     NaN
Section 2    10.0     NaN      20     5.0    20.0

In [39]:
pd.DataFrame(data,columns=["Anmole","Sanyam"])

   Anmole  Sanyam
0     NaN     NaN
1    10.0    20.0

# Basic DataFrame Operations

In [40]:
df

   Age  Salary
D   22    1000
A   23    2000
C   45    3000

In [41]:
df["Age"]

D    22
A    23
C    45
Name: Age, dtype: int64

In [52]:
df["Higher Salary"]=df["Salary"]>1000
df

   Salary  Higher Salary
D    1000          False
A    2000           True
C    3000           True

In [44]:
Age=df.pop("Age")

In [45]:
Age

D    22
A    23
C    45
Name: Age, dtype: int64

In [49]:
df

   Salary  Higher Salary
D    1000          False
A    2000           True
C    3000           True

In [53]:
del df["Higher Salary"]

In [54]:
df

   Salary
D    1000
A    2000
C    3000

In [55]:
df.insert(0,'Copy of Salary',df['Salary'])

In [56]:
df

   Copy of Salary  Salary
D            1000    1000
A            2000    2000
C            3000    3000

In [62]:
df.insert(1,'Copy of Salary 3',df['Salary'])

Can duplicate values but col name should be unique

In [60]:
df

   Copy of Salary  Copy of Salary 2  Salary
D            1000              1000    1000
A            2000              2000    2000
C            3000              3000    3000

# Case Study: Movie Data Analysis

In [63]:
movies=pd.read_csv("movies.csv",sep=',')

In [67]:
print(type(movies))

<class 'pandas.core.frame.DataFrame'>

In [66]:
movies.head(15)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller
10,11,"American President, The (1995)",Comedy|Drama|Romance
11,12,Dracula: Dead and Loving It (1995),Comedy|Horror
12,13,Balto (1995),Adventure|Animation|Children
13,14,Nixon (1995),Drama
14,15,Cutthroat Island (1995),Action|Adventure|Romance

In [68]:
movies.tail(10)

,movieId,title,genres
9732,193565,Gintama: The Movie (2010),Action|Animation|Comedy|Sci-Fi
9733,193567,anohana: The Flower We Saw That Day - The Movi...,Animation|Drama
9734,193571,Silver Spoon (2014),Comedy|Drama
9735,193573,Love Live! The School Idol Movie (2015),Animation
9736,193579,Jon Stewart Has Left the Building (2015),Documentary
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy